#include "PlayerStop.h"

PlayerState* PlayerStop::state = nullptr;

/***************************************************************************
*|	概要　	インスタンスを取得する
*|	引数　　無し
*|　戻り値　プレイヤの状態
****************************************************************************/
PlayerState* PlayerStop::GetInstance()
{
	if (state == nullptr)
	{
		state = new PlayerStop();
	}

	return state;
}




/***************************************************************************
*|	概要　　実行する
*|	引数　　プレイヤ
*|　戻り値　無し
****************************************************************************/
void PlayerStop::Execute(Player * player)
{
}



/***************************************************************************
*|	概要　　破棄する
*|	引数　　無し
*|　戻り値　無し
****************************************************************************/
void PlayerStop::Dispose()
{
	if (state != nullptr)
	{
		delete state;
	}
}
