//#include "PlayerRun.h"
//
////pPlayerState静的変数を初期化する
//PlayerState* PlayerRun::state = nullptr;
//
///***************************************************************************
//*|	概要　	PlayerRunクラスのインスタンスを取得する
//*|	引数　　無し
//*|　戻り値　プレイヤの状態
//****************************************************************************/
//PlayerState* PlayerRun::GetInstance()
//{
//	if (state == nullptr)
//	{
//		state = new PlayerRun();
//	}
//
//	return state;
//}
//
//
//
//
///***************************************************************************
//*|	概要　　動く
//*|	引数　　無し
//*|　戻り値　無し
//****************************************************************************/
//void PlayerRun::Execute(Player * pPlayer)
//{
//
//}
//
//
//
///***************************************************************************
//*|	概要　　破棄する
//*|	引数　　無し
//*|　戻り値　無し
//****************************************************************************/
//void PlayerRun::Dispose()
//{
//	if (state != nullptr)
//	{
//		delete state;
//	}
//}
