//#include "PlayerStop.h"
////pPlayerState静的変数を初期化する
//PlayerState* PlayerStop::state = nullptr;
//
///***************************************************************************
//*|	概要　	Advanceクラスのインスタンスを取得する
//*|	引数　　無し
//*|　戻り値　プレイヤの状態
//****************************************************************************/
//PlayerState* PlayerStop::GetInstance()
//{
//	if (state == nullptr)
//	{
//		state = new PlayerStop();
//	}
//
//	return state;
//}
//
//
//
//
///***************************************************************************
//*|	概要　　動く
//*|	引数　　無し
//*|　戻り値　無し
//****************************************************************************/
//void PlayerStop::Execute(Player * pPlayer)
//{
//
//}
//
//
//
///***************************************************************************
//*|	概要　　破棄する
//*|	引数　　無し
//*|　戻り値　無し
//****************************************************************************/
//void PlayerStop::Dispose()
//{
//	if (state != nullptr)
//	{
//		delete state;
//	}
//}
