//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   MemoryLeakDetector.h
//!
//! @brief  メモリーリーク検出関連のヘッダファイル
//!
//! @date   2016/11/07
//!
//! @author 高木 晋
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルード防止 ====================================================
#pragma once




// マクロ定義 ==============================================================
#if defined(_DEBUG)
  #define _CRTDBG_MAP_ALLOC
#endif




// ヘッダファイルの読み込み ================================================
#if defined(_DEBUG)
  #include <crtdbg.h>
  #include <cstdlib>
#endif




// マクロ定義 ==============================================================
#if defined(_DEBUG)
  #define new new(_NORMAL_BLOCK, __FILE__, __LINE__)
#endif




// インライン関数定義 ======================================================
#if defined(_DEBUG)
  //------------------------------------------------------------------
  //! @brief メモリーリーク検出機構のセットアップ
  //!
  //! @param なし
  //!
  //! @return なし
  //------------------------------------------------------------------
  inline void SetUpMemoryLeakDetector()
  {
	  // メモリーリーク検出のための設定
	  _CrtSetDbgFlag(_CRTDBG_LEAK_CHECK_DF | _CRTDBG_ALLOC_MEM_DF);
  }
#endif
